# ClosestPointsPairBetweenTwoCurves Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves Constructor
ClosestPointsPairBetweenTwoCurves Class See Also
---
Obtain a new instance of ClosestPointsPairBetweenTwoCurves class.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public ClosestPointsPairBetweenTwoCurves()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ClosestPointsPairBetweenTwoCurves()
```

# See Also
ClosestPointsPairBetweenTwoCurves Class
ClosestPointsPairBetweenTwoCurves Overload
Autodesk.Revit.DB Namespace